app/controllers/application_controller.rb

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def current_user
    @current_user ||= Employee.find(session[:employee_id]) if session[:employee_id]