app/controllers/assignments_controller.rb

  def index
    unless current_user.role?(:employee)
      @current_assignments=Assignment.current.paginate(:page => params[:page]).per_page(5)
---
SELECT COUNT(*) FROM "assignments" WHERE (end_date IS NOT NULL)