app/controllers/employees_controller.rb

SELECT COUNT(*) FROM "employees" WHERE (role = 'manager') AND "employees"."active" = ?  [["active", 1]]
---
  def index
      @active_managers = Employee.managers.active.paginate(:page => params[:page]).per_page(5)

INSERT INTO "employees" ("first_name", "last_name", "ssn", "date_of_birth", "phone", "role", "active") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
      @employee = Employee.new(employee_params)
      if @employee.save

UPDATE "employees" SET "first_name" = ?, "last_name" = ?, "ssn" = ?, "phone" = ?, "date_of_birth" = ? WHERE "employees"."id" = ?
---
  def update
      if @employee.update(employee_params)

SELECT "assignments".* FROM "assignments" WHERE "assignments"."employee_id" = ?
---
  def show
      @current_assignment = @employee.current_assignment
      @previous_assignments = @employee.assignments.to_a - [@current_assignment]