app/controllers/employees_controller.rb

  def edit
      if current_user.role?(:admin)
          @employee = Employee.find(params[:id])
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?