app/controllers/stores_controller.rb

  def index
      @active_stores = Store.active.paginate(:page => params[:page]).per_page(5)
---
SELECT  "stores".* FROM "stores" WHERE "stores"."active" = ? LIMIT ? OFFSET ?  [["active", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "stores" WHERE "stores"."active" != ?  [["active", 1]]

  def create
      @store = Store.new(store_params)
      if @store.save
---
INSERT INTO "stores" ("name", "street", "city", "state", "zip", "phone", "active") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
      if @store.update(store_params)
---
UPDATE "stores" SET "name" = ?, "street" = ?, "city" = ?, "zip" = ?, "phone" = ? WHERE "stores"."id" = ?

  def show
      @current_managers = Assignment.current.for_store(@store).for_role('manager').map{|a| a.employee}
      @current_employees = Assignment.current.for_store(@store).map{|a| a.employee}
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "assignments".* FROM "assignments" WHERE (end_date IS NULL) AND (store_id = 1)

    def set_store
      @store = Store.find(params[:id])
---
SELECT  "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT ?